---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AutoDetectIgnoreLeaderWarning
source: html/e1931899-494f-f4a1-d2cf-458f67043a82.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AutoDetectIgnoreLeaderWarning Property

Analytical Model for Structural Element has reset to its default location.

## Syntax (C#)
```csharp
public static FailureDefinitionId AutoDetectIgnoreLeaderWarning { get; }
```